app/controllers/api/v1/bets_controller.rb

SELECT "bets".* FROM "bets"
---
    def index
        bets = Bet.all