app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "coraline"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "coraline"], ["created_at", "2019-11-11 22:24:00.205563"], ["updated_at", "2019-11-11 22:24:00.205563"]]
---
    def create
        if User.find_by(name: params[:name])
            user = User.find_by(name: params[:name])
            render json: UserSerializer.new(user).to_serialized_json
        else
            user = User.create(name: params[:name])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def update
        user = User.find_by(id: params[:id])